'''4) Написать функцию которая принимает в качестве аргумента строку,
и возвращает True, если строка является полиндромом и False если нет.'''

# text = 'А роза упала на лапу Азора' # Известный пример палиндрома
text = input('Введите строку для проверки: ')
text_cut = text.lower() # для логического сравнения нам необходимо не учитывать регистр символов.
while " " in text_cut: # для логического сравнения нам необходимо не учитывать пробелы, удаляем их.
    text_cut = text_cut.replace(' ', '')
l_text = list(text_cut)
l_text_reverse = l_text.copy()
l_text_reverse.reverse()
print(f'Строка является палиндромом - {l_text == l_text_reverse}') # вставляем в ответ вывод логической функции сравнения строк




# text_2 = ''
# a = len(text)
# for i in range(a+1): # задаем цикл для "переворота" строки задом на перед
#     text_2 += text[-i]
# text_2 = text_2[1:] # обрезаем первый символ полученного "перевертыша" из-за наложения при перевороте строки
# print(f'Исходная строка:\n{text}')
# print(f'Строка "наоборот":\n{text_2}')
# text_cut = text
# while " " in text_cut: # для логического сравнения строк нам необходимо не учитывать пробелы, удаляем их.
#     text_cut = text.replace(' ', '')
#     text_cut_2 = text_2.replace(' ', '')
# print(f'Строка является палиндромом - {text_cut == text_cut_2}') # вставляем в ответ вывод логической функции сравнения строк

