'''написать функцию которая в качестве аргумента принимает размер стороны квадрата,
а возвращает кортеж в котором лежат три значения:
периметр квадрата
диагональ квадрата
площадь квадрата'''

import math # импорт мат. функций


def find_square_atribute(a): # задаем функцию с одним аргументом (длина стороны квадрата)
    p = a*4
    s = a**2
    d = math.sqrt(2*(a**2)) # математическое описание функции
    return p, d, s # формируем кортеж для вывода значений функции


a = float(input('введите длину (см) стороны квадрата: ')) # запрашиваем  аргумент для функции
print(f'периметр (см) = {round(find_square_atribute(a)[0], 2)}, длина диагонали (см) = {round(find_square_atribute(a)[1], 2)}, '
      f'площадь квадрата (см2) = {round(find_square_atribute(a)[2], 2)}')

