'''написать функцию, которая принимает в качестве аргументов два списка,
а возвращает список, состоящий из элементов этих двух списков, при чем первый элемент списка -
первый элемент первого аргумента, второй элемент списка - первый элемент второго списка,
третий элемент - второй элемент первого списка, четвертый - второй элемент второго аргумента и т.д.
т.е для аргументов [1, 2, 3] и [11, 22, 33] функция должна вернуть [1, 11, 2, 22, 3, 33].
Будет плюсом использование генераторов последовательностей для решения этой задачи.'''


l_1 = [1, 2, 3]
l_2 = [11, 22, 33]
l_3 = []


def zip_list_1(l_1, l_2): # использовали обычный перебор элементов списков и их поочредное добавление в конечный список
    for i in range(len(l_1)):
        l_3.append(l_1[i])
        l_3.append(l_2[i])
    return l_3


def zip_list_2 (l_1, l_2): # использовали генератор списков через "сшивание" функцией  zip
    l_3 = [a for b in zip(l_1, l_2) for a in b]
    return l_3



print(zip_list_1(l_1, l_2))
print(zip_list_2(l_1, l_2))