'''написать функцию которая принимает в качестве аргумента номер месяца,
а возвращает строку - время года, этого месяца'''


month_n = int(input('Введите номер месяца: '))
while not 0 < month_n < 13: # проверям правильность ввода номера месяца
    month_n = int(input('\nВы ввели некоректный номер месяца. Повторите ввод: '))


def find_season(m): # функция определяющая по номеру месяца его принадлежность к сезону
    if m == 1 or m == 2 or m == 12:
        s = 'Зима'
    elif 2 < m < 6:
        s = 'Весна'
    elif 5 < m < 9:
        s = 'Лето'
    else:
        s = 'Осень'
    return s


print(f'\nМесяц № {month_n}  соответсвует времени года - {find_season(month_n)}')