'''4) Написать функцию которая принимает в качестве аргумента строку,
и возвращает True, если строка является полиндромом и False если нет.'''

# text = 'А роза упала на лапу Азора' # Известный пример палиндрома
text = input('Введите строку для проверки: ')
text_cut = text.lower() # для логического сравнения нам необходимо не учитывать регистр символов.
while " " in text_cut: # для логического сравнения нам необходимо не учитывать пробелы, удаляем их.
    text_cut = text_cut.replace(' ', '')
l_text = list(text_cut) # для упрощения сравнения строки посимвольно, переделываем ее в список символов
l_text_reverse = l_text.copy() # создаем копию списка символов для последующего сравнения
l_text_reverse.reverse() # "переворачиваем" копию исходного списка
print(f'Строка является палиндромом - {l_text == l_text_reverse}') # вставляем в ответ вывод логической функции сравнения списков

